// ДЗ: реализ пару интферфейсов, которые возвращают свойство предметов, например стоимость, вес. 
// Интерфейс, который позв узнать стоимость и вес + реализ несколько эл самых разных, меч - вес, цена; бутылка - вес, цена 
// Задания со * сундук, внутри которого лежат предметы и его вес будет склад из веса сундука и пред, которые в нем лежат
// Класс персонаж с предметами в инвентаре, экипировка, который тоже реализ интерфейс -> узнать стоимость предметов и вес 
// + есть коллекция со всеми предметами, пробежаться по ней и посчитать суммарную стоимость в конце 
// Пусть у интерфейса будет 1 метод, который возвр вес 


using System.Linq; 

